In [1]:
import psycopg2
import pandas as pd

def run(query):
    conn = psycopg2.connect(database = 'contoh_db', user = "postgres", password = '51200', host = "localhost", port = "5432")
    cur = conn.cursor()
#     cur.execute(query)
#     return cur.fetchall()
    return pd.read_sql(query, conn)

# No 1

In [2]:
query = "SELECT * FROM _offices ORDER BY country, state, city;"
run(query)

,officecode,city,phone,addressline1,addressline2,state,country,postalcode,territory
0,6,Sydney,+61 2 9264 2451,5-11 Wentworth Avenue,Floor #2,,Australia,NSW 2010,APAC
1,4,Paris,+33 14 723 4404,43 Rue Jouffroy D'abbans,,,France,75017,EMEA
2,5,Tokyo,+81 33 224 5000,4-1 Kioicho,,Chiyoda-Ku,Japan,102-8578,Japan
3,7,London,+44 20 7877 2041,25 Old Broad Street,Level 7,,UK,EC2N 1HN,EMEA
4,1,San Francisco,+1 650 219 4782,100 Market Street,Suite 300,CA,USA,94080,NA
5,2,Boston,+1 215 837 0825,1550 Court Place,Suite 102,MA,USA,02107,NA
6,3,NYC,+1 212 555 3000,523 East 53rd Street,apt. 5A,NY,USA,10022,NA

# NO 2

In [3]:
query = "SELECT COUNT(employeenumber) FROM _employees"
run(query)

   count
0     23

# NO 3

In [4]:
run(
'''
SELECT SUM (amount) FROM _payments
'''
)

          sum
0  8853839.23

# No 4

In [5]:
query = '''
    SELECT * FROM _products
    WHERE productline LIKE '%Cars%';
'''
run(query)

,productcode,productname,productline,productscale,productvendor,productdescription,quantityinstock,buyprice,msrp
0,S10_1949,1952 Alpine Renault 1300,Classic Cars,1:10,Classic Metal Creations,Turnable front wheels; steering function; deta...,7305,98.58,214.30
1,S10_4757,1972 Alfa Romeo GTA,Classic Cars,1:10,Motor City Art Classics,Features include: Turnable front wheels; steer...,3252,85.68,136.00
2,S10_4962,1962 LanciaA Delta 16V,Classic Cars,1:10,Second Gear Diecast,Features include: Turnable front wheels; steer...,6791,103.42,147.74
3,S12_1099,1968 Ford Mustang,Classic Cars,1:12,Autoart Studio Design,"Hood, doors and trunk all open to reveal highl...",68,95.34,194.57
4,S12_1108,2001 Ferrari Enzo,Classic Cars,1:12,Second Gear Diecast,Turnable front wheels; steering function; deta...,3619,95.59,207.80
...,...,...,...,...,...,...,...,...,...
57,S24_4258,1936 Chrysler Airflow,Vintage Cars,1:24,Second Gear Diecast,"Features opening trunk, working steering syst...",4710,57.46,97.39
58,S24_4620,1961 Chevrolet Impala,Classic Cars,1:18,Classic Metal Creations,This 1:18 scale precision die-cast reproductio...,7869,32.33,80.84
59,S32_4289,1928 Ford Phaeton Deluxe,Vintage Cars,1:32,Highway 66 Mini Classics,This model features grille-mounted chrome horn...,136,33.02,68.79
60,S50_1341,1930 Buick Marquette Phaeton,Vintage Cars,1:50,Studio M Art Models,"Features opening trunk, working steering system",7062,27.06,43.64
61,S700_2824,1982 Camaro Z28,Classic Cars,1:18,Carousel DieCast Legends,Features include opening and closing doors. Co...,6934,46.53,101.15

# No. 5

In [12]:
query = '''
    SELECT SUM(amount) FROM _payments
    WHERE paymentdate <= '2004-10-28';
'''
run(query)

          sum
0  5887073.03